arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_event.h
// Output Selection for GPT3 1
#define EVENT_O_GPT3BCAPTSEL                                        0x00000604

// Output Selection for AUX Subscriber 0
#define EVENT_O_AUXSEL0                                             0x00000700

// Output Selection for NMI Subscriber 0
#define EVENT_O_CM3NMISEL0                                          0x00000800

// Output Selection for I2S Subscriber 0
#define EVENT_O_I2SSTMPSEL0                                         0x00000900

// Output Selection for FRZ Subscriber 0
#define EVENT_O_FRZSEL0                                             0x00000A00

// Set or Clear Software Events
#define EVENT_O_SWEV                                                0x00000F00

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL0
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_GPIO_EDGE            Edge detect event from IOC. Configureded by the
// IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings
#define EVENT_CPUIRQSEL0_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL0_EV_S                                                0
#define EVENT_CPUIRQSEL0_EV_AON_GPIO_EDGE                           0x00000004

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL1
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// I2C_IRQ                  Interrupt event from I2C
#define EVENT_CPUIRQSEL1_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL1_EV_S                                                0
#define EVENT_CPUIRQSEL1_EV_I2C_IRQ                                 0x00000009

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL2
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// RFC_CPE_1                Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event
#define EVENT_CPUIRQSEL2_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL2_EV_S                                                0
#define EVENT_CPUIRQSEL2_EV_RFC_CPE_1                               0x0000001E

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL3
//
//*****************************************************************************
//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL4
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_COMB             Event from AON_RTC, controlled by the
// AON_RTC:CTL.COMB_EV_MASK setting
#define EVENT_CPUIRQSEL4_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL4_EV_S                                                0
#define EVENT_CPUIRQSEL4_EV_AON_RTC_COMB                            0x00000007

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL5
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// UART0_COMB               UART0 combined interrupt, interrupt flags are found
// here UART0:MIS
#define EVENT_CPUIRQSEL5_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL5_EV_S                                                0
#define EVENT_CPUIRQSEL5_EV_UART0_COMB                              0x00000024

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL6
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SWEV0                AUX software event 0, triggered by
// AUX_EVCTL:SWEVSET.SWEV0, also available as AUX_EVENT0 AON wake up event.
// MCU domain wakeup control AON_EVENT:MCUWUSEL
// AUX domain wakeup control AON_EVENT:AUXWUSEL
#define EVENT_CPUIRQSEL6_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL6_EV_S                                                0
#define EVENT_CPUIRQSEL6_EV_AUX_SWEV0                               0x0000001C

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL7
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI0_COMB                SSI0 combined interrupt, interrupt flags are found
// here SSI0:MIS
#define EVENT_CPUIRQSEL7_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL7_EV_S                                                0
#define EVENT_CPUIRQSEL7_EV_SSI0_COMB                               0x00000022

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL8
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_COMB                SSI0 combined interrupt, interrupt flags are found
// here SSI1:MIS
#define EVENT_CPUIRQSEL8_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL8_EV_S                                                0
#define EVENT_CPUIRQSEL8_EV_SSI1_COMB                               0x00000023

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL9
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// RFC_CPE_0                Combined Interrupt for CPE Generated events.
// Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected
// with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event
#define EVENT_CPUIRQSEL9_EV_M                                       0x0000007F
#define EVENT_CPUIRQSEL9_EV_S                                                0
#define EVENT_CPUIRQSEL9_EV_RFC_CPE_0                               0x0000001B

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL10
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// RFC_HW_COMB              Combined RCF hardware interrupt, corresponding flag
// is here RFC_DBELL:RFHWIFG
#define EVENT_CPUIRQSEL10_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL10_EV_S                                               0
#define EVENT_CPUIRQSEL10_EV_RFC_HW_COMB                            0x0000001A

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL11
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// RFC_CMD_ACK              RFC Doorbell Command Acknowledgement Interrupt,
// equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
#define EVENT_CPUIRQSEL11_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL11_EV_S                                               0
#define EVENT_CPUIRQSEL11_EV_RFC_CMD_ACK                            0x00000019

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL12
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// I2S_IRQ                  Interrupt event from I2S
#define EVENT_CPUIRQSEL12_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL12_EV_S                                               0
#define EVENT_CPUIRQSEL12_EV_I2S_IRQ                                0x00000008

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL13
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SWEV1                AUX software event 1, triggered by
// AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
// MCU domain wakeup control AON_EVENT:MCUWUSEL
// AUX domain wakeup control AON_EVENT:AUXWUSEL
#define EVENT_CPUIRQSEL13_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL13_EV_S                                               0
#define EVENT_CPUIRQSEL13_EV_AUX_SWEV1                              0x0000001D

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL14
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// WDT_IRQ                  Watchdog interrupt event, controlled by
// WDT:CTL.INTEN
#define EVENT_CPUIRQSEL14_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL14_EV_S                                               0
#define EVENT_CPUIRQSEL14_EV_WDT_IRQ                                0x00000018

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL15
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT0A                    GPT0A interrupt event, controlled by GPT0:TAMR
#define EVENT_CPUIRQSEL15_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL15_EV_S                                               0
#define EVENT_CPUIRQSEL15_EV_GPT0A                                  0x00000010

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL16
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT0B                    GPT0B interrupt event, controlled by GPT0:TBMR
#define EVENT_CPUIRQSEL16_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL16_EV_S                                               0
#define EVENT_CPUIRQSEL16_EV_GPT0B                                  0x00000011

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL17
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT1A                    GPT1A interrupt event, controlled by GPT1:TAMR
#define EVENT_CPUIRQSEL17_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL17_EV_S                                               0
#define EVENT_CPUIRQSEL17_EV_GPT1A                                  0x00000012

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL18
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT1B                    GPT1B interrupt event, controlled by GPT1:TBMR
#define EVENT_CPUIRQSEL18_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL18_EV_S                                               0
#define EVENT_CPUIRQSEL18_EV_GPT1B                                  0x00000013

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL19
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT2A                    GPT2A interrupt event, controlled by GPT2:TAMR
#define EVENT_CPUIRQSEL19_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL19_EV_S                                               0
#define EVENT_CPUIRQSEL19_EV_GPT2A                                  0x0000000C

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL20
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT2B                    GPT2B interrupt event, controlled by GPT2:TBMR
#define EVENT_CPUIRQSEL20_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL20_EV_S                                               0
#define EVENT_CPUIRQSEL20_EV_GPT2B                                  0x0000000D

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL21
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT3A                    GPT3A interrupt event, controlled by GPT3:TAMR
#define EVENT_CPUIRQSEL21_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL21_EV_S                                               0
#define EVENT_CPUIRQSEL21_EV_GPT3A                                  0x0000000E

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL22
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// GPT3B                    GPT3B interrupt event, controlled by GPT3:TBMR
#define EVENT_CPUIRQSEL22_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL22_EV_S                                               0
#define EVENT_CPUIRQSEL22_EV_GPT3B                                  0x0000000F

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL23
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// CRYPTO_RESULT_AVAIL_IRQ  CRYPTO result available interupt event, the
// corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by
// CRYPTO:IRQSTAT.RESULT_AVAIL
#define EVENT_CPUIRQSEL23_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL23_EV_S                                               0
#define EVENT_CPUIRQSEL23_EV_CRYPTO_RESULT_AVAIL_IRQ                0x0000005D

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL24
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// DMA_DONE_COMB            Combined DMA done, corresponding flags are here
// UDMA0:REQDONE
#define EVENT_CPUIRQSEL24_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL24_EV_S                                               0
#define EVENT_CPUIRQSEL24_EV_DMA_DONE_COMB                          0x00000027

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL25
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// DMA_ERR                  DMA bus error, corresponds to UDMA0:ERROR.STATUS
#define EVENT_CPUIRQSEL25_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL25_EV_S                                               0
#define EVENT_CPUIRQSEL25_EV_DMA_ERR                                0x00000026

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL26
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// FLASH                    FLASH controller error event,  the status flags are
// FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT
#define EVENT_CPUIRQSEL26_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL26_EV_S                                               0
#define EVENT_CPUIRQSEL26_EV_FLASH                                  0x00000015

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL27
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_CPUIRQSEL27_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL27_EV_S                                               0
#define EVENT_CPUIRQSEL27_EV_SWEV0                                  0x00000064

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL28
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_COMB                 AUX combined event, the corresponding flag register
// is here AUX_EVCTL:EVTOMCUFLAGS
#define EVENT_CPUIRQSEL28_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL28_EV_S                                               0
#define EVENT_CPUIRQSEL28_EV_AUX_COMB                               0x0000000B

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL29
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AON_PROG0                AON programmable event 0. Event selected by
// AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV
#define EVENT_CPUIRQSEL29_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL29_EV_S                                               0
#define EVENT_CPUIRQSEL29_EV_AON_PROG0                              0x00000001

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL30
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// AON_RTC_UPD              RTC periodic event controlled by
// AON_RTC:CTL.RTC_UPD_EN
// AUX_OBSMUX0              Loopback of OBSMUX0 through AUX, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL
// AUX_ADC_DONE             AUX ADC done, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE
// AUX_SMPH_AUTOTAKE_DONE   Autotake event from AUX semaphore, configured by
// AUX_SMPH:AUTOTAKE
// AUX_TIMER1_EV            AUX timer 1 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV
// AUX_TIMER0_EV            AUX timer 0 event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV
// AUX_TDC_DONE             AUX TDC measurement done event, corresponds to the
// flag AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status
// AUX_TDC:STAT.DONE
// AUX_COMPB                AUX Compare B event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_AON_WU_EV            AON wakeup event, corresponds flags are here
// AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV
// RFC_IN_EV5               RFC RAT event 5, configured by RFC_RAT:RATEV.OEVT5
// RFC_IN_EV4               RFC RAT event 4, configured by RFC_RAT:RATEV.OEVT4
// CRYPTO_DMA_DONE_IRQ      CRYPTO DMA input done event, the correspondingg
// flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled by CRYPTO:IRQEN.DMA_IN_DONE
// DMA_CH18_DONE            DMA done for software tiggered UDMA channel 18, see
// UDMA0:SOFTREQ
// DMA_CH0_DONE             DMA done for software tiggered UDMA channel 0, see
// UDMA0:SOFTREQ
// AON_AUX_SWEV0            AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0
// I2S_IRQ                  Interrupt event from I2S
// AON_PROG2                AON programmable event 2. Event selected by
// AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV
// AON_PROG1                AON programmable event 1. Event selected by
// AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG1_EV
// NONE                     Always inactive
#define EVENT_CPUIRQSEL30_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL30_EV_S                                               0
#define EVENT_CPUIRQSEL30_EV_ALWAYS_ACTIVE                          0x00000079
#define EVENT_CPUIRQSEL30_EV_AON_RTC_UPD                            0x00000077
#define EVENT_CPUIRQSEL30_EV_AUX_OBSMUX0                            0x00000072
#define EVENT_CPUIRQSEL30_EV_AUX_ADC_FIFO_ALMOST_FULL               0x00000071
#define EVENT_CPUIRQSEL30_EV_AUX_ADC_DONE                           0x00000070
#define EVENT_CPUIRQSEL30_EV_AUX_SMPH_AUTOTAKE_DONE                 0x0000006F
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER1_EV                          0x0000006E
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER0_EV                          0x0000006D
#define EVENT_CPUIRQSEL30_EV_AUX_TDC_DONE                           0x0000006C
#define EVENT_CPUIRQSEL30_EV_AUX_COMPB                              0x0000006B
#define EVENT_CPUIRQSEL30_EV_AUX_AON_WU_EV                          0x00000069
#define EVENT_CPUIRQSEL30_EV_RFC_IN_EV5                             0x00000060
#define EVENT_CPUIRQSEL30_EV_RFC_IN_EV4                             0x0000005F
#define EVENT_CPUIRQSEL30_EV_CRYPTO_DMA_DONE_IRQ                    0x0000005E
#define EVENT_CPUIRQSEL30_EV_DMA_CH18_DONE                          0x00000016
#define EVENT_CPUIRQSEL30_EV_DMA_CH0_DONE                           0x00000014
#define EVENT_CPUIRQSEL30_EV_AON_AUX_SWEV0                          0x0000000A
#define EVENT_CPUIRQSEL30_EV_I2S_IRQ                                0x00000008
#define EVENT_CPUIRQSEL30_EV_AON_PROG2                              0x00000003
#define EVENT_CPUIRQSEL30_EV_AON_PROG1                              0x00000002
#define EVENT_CPUIRQSEL30_EV_NONE                                   0x00000000

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL31
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_COMPA                AUX Compare A event, corresponds to
// AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
#define EVENT_CPUIRQSEL31_EV_M                                      0x0000007F
#define EVENT_CPUIRQSEL31_EV_S                                               0
#define EVENT_CPUIRQSEL31_EV_AUX_COMPA                              0x0000006A

